
l1=[6.5 , 4, 3, 9, 334, 940, 44.8, 4 , 4545, 33.99]
"""
l2=[4,3]
l1.sort()
#این عضو یا این لیست رو داخل بسته به ته لیست من اضافه کن
l1.append(l2)
#بدون بسته
l1.extend(l2)
#تو این جایگاه، این عضو رو اضافه کن
l1.insert(1,100)

#l1.clear()
#حذف یه عضو که میدونیم از لیست
l1.remove(4)
#حذف عنصر یه جایگاه خاص از لیست
del l1[0]

del l1[0:10:2]
#عضو این جایگاه رو بیار بیرون
l1.pop(3)
#این عضو در کدوم جایگاه لیسته
l1.index(44.8)

a= l1.index(4,0,6)
#تعداد این عضو من تو لیست چندتاست
b=l1.count(4)

l1.reverse()

#slice
#از این جایگاه تا اون جایگاه با این استپ برای من عضو های لیست رو کپی کن
x=l1[0:3:5]
print(x)

#list comprehension

g=l1[ [4]*2 if [4]<5 else [4]*1 ]

print(g)

#input("hi, what's your name?\n")

list1=["a","d","v"]
x=" * ".join(list1)
print(x)
"""